app/controllers/issues_controller.rb

SELECT * FROM `issues` WHERE (`issues`.`status` = 'open' AND `issues`.`issue_type` = 'Bug') ORDER BY id DESC
---
  def index
    @open_bugs = Issue.find_all_by_issue_type_and_status("Bug","open",:order => "id DESC")

SELECT * FROM `issues` WHERE (`issues`.`status` = 'Open' AND `issues`.`issue_type` = 'Bug' AND `issues`.`assigned_to` = 3) ORDER BY id DESC
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
  def user_issues
    @open_bugs = Issue.find_all_by_assigned_to_and_issue_type_and_status(params[:id],"Bug","open",:order => "id DESC")
    @closed_bugs = Issue.find_all_by_assigned_to_and_issue_type_and_status(params[:id],"Bug","closed",:order => "id DESC")
    @open_features = Issue.find_all_by_assigned_to_and_issue_type_and_status(params[:id],"Feature","open",:order => "id DESC")
    @closed_features = Issue.find_all_by_assigned_to_and_issue_type_and_status(params[:id],"Feature","closed",:order => "id DESC")
    @user = User.find_by_id(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
  def edit_user_details
    @user = User.find_by_id(params[:id])