app/controllers/issues_controller.rb

SELECT * FROM `issues` WHERE (`issues`.`id` = 28)
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `posts` WHERE (`posts`.`issue_id` = '28')
SELECT * FROM `visits` WHERE (`visits`.`user_id` = 1 AND `visits`.`issue_id` = 28) LIMIT 1
UPDATE `visits` SET `visited_at` = '2011-06-16 10:24:30' WHERE `id` = 148
---
  def show
    @issue = Issue.find(params[:id])
    @assigned_by = User.find_by_id(@issue.user_id)
    @user = User.find_by_id(@issue.assigned_to)
    @posts = Post.find_all_by_issue_id(params[:id])
    if params[:from] != "posts"
      @visit = Visit.find_by_user_id_and_issue_id(current_user.id,@issue.id)
      @visit.update_attribute(:visited_at,Time.now)

SELECT * FROM `issues` WHERE (`issues`.`id` = 29)
---
  def edit
    @issue = Issue.find(params[:id])

INSERT INTO `issues` (`assigned_to`, `image_file_name`, `created_at`, `image_file_size`, `short_description`, `updated_at`, `detailed_description`, `issue_type`, `image_content_type`, `user_id`, `status`) VALUES(1, NULL, '2011-06-16 10:23:50', NULL, NULL, '2011-06-16 10:23:50', NULL, 'Bug', NULL, 2, NULL)
UPDATE `issues` SET `updated_at` = '2011-06-16 10:23:50', `status` = 'Open', `short_description` = 'Terms and Conditions link is not working', `detailed_description` = '' WHERE `id` = 29
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
SELECT * FROM `users`
INSERT INTO `visits` (`issue_id`, `user_id`, `visited_at`) VALUES(29, 1, '2011-06-16 10:23:50')
---
  def create
    @issue = current_user.issues.create(params[:issue])
    @issue.short_description = params[:summary]
    @issue.detailed_description = params[:detailed_description]
    @issue.status = "Open"
    @issue.save
    @user = User.find(@issue.assigned_to)
#    @all_users = User.find_all_by_user_id(2422)  # for staging
    @all_users = User.all
    @all_users.each do |user|
      @visit = Visit.new
      @visit.user_id = user.id
      @visit.issue_id = @issue.id
      @visit.visited_at = Time.now
      @visit.save

SELECT * FROM `issues` WHERE (`issues`.`issue_type` = 'Bug' AND `issues`.`assigned_to` = 1) ORDER BY id DESC
SELECT * FROM `issues` WHERE (`issues`.`user_id` = 1) ORDER BY id DESC
SELECT * FROM `issues` WHERE (`issues`.`status` = 'Open' AND `issues`.`issue_type` = 'Bug' AND `issues`.`assigned_to` = 1) ORDER BY id DESC
---
  def my_issues
    #objects for my_issue  page with the type of bugs ,features, enhancements , tasks ,questions
    @bugs = Issue.find_all_by_assigned_to_and_issue_type(current_user.id,"Bug",:order => "id DESC")
    @features = Issue.find_all_by_assigned_to_and_issue_type(current_user.id,"Feature",:order => "id DESC")
    @enhancements = Issue.find_all_by_assigned_to_and_issue_type(current_user.id,"Enhancement",:order => "id DESC")
    @tasks = Issue.find_all_by_assigned_to_and_issue_type(current_user.id,"Task",:order => "id DESC")
    @queries = Issue.find_all_by_assigned_to_and_issue_type(current_user.id,"Query",:order => "id DESC")
    @assigned_by_me = Issue.find_all_by_user_id(current_user.id,:order=>"id DESC")

    @open_bugs = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Bug","Open",:order => "id DESC")

SELECT * FROM `issues` WHERE (`issues`.`issue_type` = 'Bug' AND `issues`.`assigned_to` = 1) ORDER BY id DESC
SELECT * FROM `issues` WHERE (`issues`.`status` = 'Open' AND `issues`.`issue_type` = 'Bug' AND `issues`.`assigned_to` = 1) ORDER BY id DESC
SELECT * FROM `issues` WHERE (`issues`.`user_id` = 1 AND `issues`.`issue_type` = 'Bug') ORDER BY id DESC
---
  def my_bugs
    @bugs = Issue.find_all_by_assigned_to_and_issue_type(current_user.id,"Bug",:order => "id DESC")
    @open_bugs = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Bug","Open",:order => "id DESC")
    @fixed_bugs = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Bug","Fixed",:order => "id DESC")
    @tested_bugs = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Bug","Tested",:order => "id DESC")
    @closed_bugs = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Bug","Closed",:order => "id DESC")
    @assigned_by_me = Issue.find_all_by_user_id_and_issue_type(current_user.id,"Bug",:order => "id DESC")

SELECT * FROM `issues` WHERE (`issues`.`issue_type` = 'Feature' AND `issues`.`assigned_to` = 1) ORDER BY id DESC
SELECT * FROM `issues` WHERE (`issues`.`status` = 'Open' AND `issues`.`issue_type` = 'Feature' AND `issues`.`assigned_to` = 1) ORDER BY id DESC
SELECT * FROM `issues` WHERE (`issues`.`user_id` = 1 AND `issues`.`issue_type` = 'Feature') ORDER BY id DESC
---
  def my_features
    @features = Issue.find_all_by_assigned_to_and_issue_type(current_user.id,"Feature",:order => "id DESC")
    @open_features = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Feature","Open",:order => "id DESC")
    @devdone_features = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Feature","Devdone",:order => "id DESC")
    @tested_features = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Feature","Tested",:order => "id DESC")
    @closed_features = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Feature","Closed",:order => "id DESC")
    @assigned_by_me = Issue.find_all_by_user_id_and_issue_type(current_user.id,"Feature",:order => "id DESC")

SELECT * FROM `issues` WHERE (`issues`.`issue_type` = 'Enhancement' AND `issues`.`assigned_to` = 1) ORDER BY id DESC
SELECT * FROM `issues` WHERE (`issues`.`status` = 'Open' AND `issues`.`issue_type` = 'Enhancement' AND `issues`.`assigned_to` = 1) ORDER BY id DESC
SELECT * FROM `issues` WHERE (`issues`.`user_id` = 1 AND `issues`.`issue_type` = 'Enhancement') ORDER BY id DESC
---
  def my_enhancements
    @enhancements = Issue.find_all_by_assigned_to_and_issue_type(current_user.id,"Enhancement",:order => "id DESC")
    @open_enhancements = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Enhancement","Open",:order => "id DESC")
    @devdone_enhancements = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Enhancement","Devdone",:order => "id DESC")
    @tested_enhancements = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Enhancement","Tested",:order => "id DESC")
    @closed_enhancements = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Enhancement","Closed",:order => "id DESC")
    @assigned_by_me = Issue.find_all_by_user_id_and_issue_type(current_user.id,"Enhancement",:order => "id DESC")

SELECT * FROM `issues` WHERE (`issues`.`issue_type` = 'Task' AND `issues`.`assigned_to` = 1) ORDER BY id DESC
SELECT * FROM `issues` WHERE (`issues`.`status` = 'Open' AND `issues`.`issue_type` = 'Task' AND `issues`.`assigned_to` = 1) ORDER BY id DESC
SELECT * FROM `issues` WHERE (`issues`.`user_id` = 1 AND `issues`.`issue_type` = 'Task') ORDER BY id DESC
---
  def my_tasks
    @tasks = Issue.find_all_by_assigned_to_and_issue_type(current_user.id,"Task",:order => "id DESC")
    @open_tasks = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Task","Open",:order => "id DESC")
    @done_tasks = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Task","Done",:order => "id DESC")
    @assigned_by_me = Issue.find_all_by_user_id_and_issue_type(current_user.id,"Task",:order => "id DESC")

SELECT * FROM `issues` WHERE (`issues`.`issue_type` = 'Query' AND `issues`.`assigned_to` = 1) ORDER BY id DESC
SELECT * FROM `issues` WHERE (`issues`.`status` = 'Open' AND `issues`.`issue_type` = 'Query' AND `issues`.`assigned_to` = 1) ORDER BY id DESC
SELECT * FROM `issues` WHERE (`issues`.`user_id` = 1 AND `issues`.`issue_type` = 'Query') ORDER BY id DESC
---
  def my_queries
    @queries = Issue.find_all_by_assigned_to_and_issue_type(current_user.id,"Query",:order => "id DESC")
    @open_queries = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Query","Open",:order => "id DESC")
    @answered_queries = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Query","Answered",:order => "id DESC")
   @assigned_by_me = Issue.find_all_by_user_id_and_issue_type(current_user.id,"Query",:order => "id DESC")

SELECT * FROM `users` ORDER BY login
---
  def user_issues
#    @users = User.find_all_by_user_id(2422,:order => 'login')   # on staging
    @users = User.all(:order => 'login')

SELECT * FROM `users` ORDER BY login
---
  def user_bugs
#    @users = User.find_all_by_user_id(2422,:order => 'login')   # on staging
    @users = User.all(:order => 'login')

SELECT * FROM `users` ORDER BY login
---
  def user_features
#    @users = User.find_all_by_user_id(2422,:order => 'login')   # on staging
    @users = User.all(:order => 'login')

SELECT * FROM `users` ORDER BY login
---
  def user_enhancements
#    @users = User.find_all_by_user_id(2422,:order => 'login')   # on staging
    @users = User.all(:order => 'login')

SELECT * FROM `users` ORDER BY login
---
  def user_tasks
#    @users = User.find_all_by_user_id(2422,:order => 'login')   # on staging
    @users = User.all(:order => 'login')

SELECT * FROM `users` ORDER BY login
---
  def user_queries
#    @users = User.find_all_by_user_id(2422,:order => 'login')   # on staging
    @users = User.all(:order => 'login')

SELECT * FROM `issues` WHERE (`issues`.`id` = '32') LIMIT 1
UPDATE `issues` SET `updated_at` = '2011-06-16 11:27:18', `status` = 'Fixed' WHERE `id` = 32
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
INSERT INTO `posts` (`created_at`, `issue_id`, `updated_at`, `user_id`, `message`) VALUES('2011-06-16 11:27:18', 32, '2011-06-16 11:27:18', 2, 'Status updated to Fixed on Thu Jun 16 16:57:18 +0530 2011')
---
  def update_issue_status
    #updating the status of the issue from open,solved,tested,closed
    @issue = Issue.find_by_id(params[:id])
    @issue.update_attribute(:status,params[:status])
    flash[:notice] = "Status Updated"
    @user = User.find_by_id(@issue.assigned_to)
    #Comment being added after the update of the status
    comment = "Status updated to #{@issue.status} on #{Time.now}"
    @post = Post.new
    @post.message = comment
    @post.user_id = current_user.id
    @post.issue_id = @issue.id
    @post.save

SELECT * FROM `issues` WHERE (`issues`.`id` = '28') LIMIT 1
UPDATE `issues` SET `updated_at` = '2011-06-16 10:24:35', `assigned_to` = 2 WHERE `id` = 28
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
INSERT INTO `posts` (`created_at`, `issue_id`, `updated_at`, `user_id`, `message`) VALUES('2011-06-16 10:24:35', 28, '2011-06-16 10:24:35', 1, 'This issue was reassigned to Karthik on Thu Jun 16 15:54:35 +0530 2011')
---
  def reassign
    #Code for reassigning of the issue
    @issue = Issue.find_by_id(params[:id])
    @issue.update_attribute(:assigned_to, params[:issue][:assigned_to])
    @user = User.find_by_id(@issue.assigned_to)
    #Adding a comment giving info about the reassigning of the issue.
    comment = "This issue was reassigned to #{@user.login} on #{Time.now}"
    @post = Post.new
    @post.message = comment
    @post.user_id = current_user.id
    @post.issue_id = @issue.id
    @post.save

SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
UPDATE `users` SET `updated_at` = '2011-06-10 10:08:43', `login` = 'Karthik' WHERE `id` = 2
---
  def update_user_details
    @user = User.find_by_id(current_user.id)
    @user.update_attributes(params[:user])