app/controllers/issues_controller.rb

SELECT * FROM `users` ORDER BY login
---
    def user_questions
    @users = User.all(:order => 'login')

SELECT * FROM `issues` WHERE (`issues`.`status` = 'open' AND `issues`.`assigned_to` = 2 AND `issues`.`issue_type` = 'Question') ORDER BY id DESC
---
  def my_questions
    @open_questions = Issue.find_all_by_assigned_to_and_issue_type_and_status(current_user.id,"Question","open",:order => "id DESC")