app/controllers/sessions_controller.rb

SELECT * FROM `users` WHERE (email = 'karthik@kern-comm.com' and activated_at IS NOT NULL) LIMIT 1
---
  def create
    @user = User.find_by_email(params[:login])